# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "google-chrome"
# AI Assistant
cask "google-gemini"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Video communication and virtual meeting platform
cask "zoom"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "wholroyd.jinja"
